tests/Qudi.Tests.Visualize/export/GenericCompositeDecoratorGraphTests.ApproveFile.approved.dot
digraph Qudi {
  rankdir=LR;
node [shape=box, fontname="Consolas"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+BatteryValidator" [label="BatteryValidator", shape=box, style=filled, fillcolor="#bbdefb"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidator" [label="ComponentValidator", shape=ellipse, style=filled, fillcolor="#bbdefb"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDecorator" [label="ComponentValidatorDecorator", shape=box, style=filled, fillcolor="#e1bee7"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDispatcher" [label="ComponentValidatorDispatcher", shape=box, style=filled, fillcolor="#fff2b3", color="#f6c445"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+GraphRoot" [label="GraphRoot", shape=ellipse, style=filled, fillcolor="#bbdefb"];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Battery>" [label="IComponentValidator<Battery>", shape=ellipse, style=filled, fillcolor="#c8e6c9"];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+IComponent>" [label="IComponentValidator<IComponent>", shape=ellipse, style=filled, fillcolor="#c8e6c9"];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Keyboard>" [label="IComponentValidator<Keyboard>", shape=box, style=dashed, color=red];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Screen>" [label="IComponentValidator<Screen>", shape=ellipse, style=filled, fillcolor="#c8e6c9"];
  "Qudi.Tests.Visualize.NullComponentValidator<T>" [label="NullComponentValidator<T>", shape=box, style=filled, fillcolor="#bbdefb"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ScreenValidator" [label="ScreenValidator", shape=box, style=filled, fillcolor="#bbdefb"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+GraphRoot" -> "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidator";
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidator" -> "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+IComponent>";
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Battery>" -> "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+BatteryValidator" [label="GenericCompositeDecoratorGraphTests"];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Screen>" -> "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ScreenValidator" [label="GenericCompositeDecoratorGraphTests"];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+IComponent>" -> "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDecorator" [label="GenericCompositeDecoratorGraphTests"];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDecorator" -> "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDispatcher";
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDispatcher" -> "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Battery>" [label="*", style=dashed];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDispatcher" -> "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Screen>" [label="*", style=dashed];
  "Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+ComponentValidatorDispatcher" -> "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Keyboard>" [label="*", style=dashed];
  "Qudi.Tests.Visualize.IComponentValidator<Qudi.Tests.Visualize.GenericCompositeDecoratorGraphTests+Keyboard>" -> "Qudi.Tests.Visualize.NullComponentValidator<T>" [label="GenericCompositeDecoratorGraphTests"];
}
